{
   "All control characters can also be accessed by an option with their name. For example, option C<--nl> is defined for the newline character.\n" : "所有控制字符也可以通过带有其名称的选项访问。例如，选项 C<--nl> 是为换行符定义的。\n",
   "Also, by default, escape characters are not converted, so decorations by ANSI escape sequences are retained.\n" : "此外，默认情况下不转换转义字符，因此保留了 ANSI 转义序列的装饰。\n",
   "At this time, Unicode markings are available for the following characters\n" : "目前，Unicode 标识可用于以下字符\n",
   "Before printing the converted string, first output the original string.\n" : "在打印转换后的字符串之前，首先输出原始字符串。\n",
   "By default, the style C<needle> is applied, which can be changed with C<--tabstyle>. If the C<--tabstyle> option is specified with no arguments, a list of available styles is displayed.\n" : "默认情况下使用 C<needle> 样式，可以使用 C<--tabstyle> 更改。如果指定 C<--tabstyle> 选项且不带参数，则会显示可用样式列表。\n",
   "Control characters can be displayed in control format and Unicode symbol characters. By default, control characters other than newline and escape characters are displayed as corresponding Unicode symbols.\n" : "控制字符可以用控制格式和 Unicode 符号字符显示。默认情况下，换行符和转义字符以外的控制字符显示为相应的 Unicode 符号。\n",
   "Disables all character conversions and resets repeat characters.\n" : "禁用所有字符转换并重置重复字符。\n",
   "From CPAN archive:\n" : "来自 CPAN 档案：\n",
   "From GIT repository:\n" : "来自 GIT 代码库：\n",
   "Git repository.\n" : "Git 仓库。\n",
   "Give the character type and flags as parameters to specify the character to be visualized and the conversion format.\n" : "将字符类型和标记作为参数，以指定要可视化的字符和转换格式。\n",
   "If C<all> is specified for the name, the value applies to all character types. The following command sets all characters to C<s>, then sets C<nl>, C<nl>, C<np>, and C<sp> to C<m> and disables C<esc>. This is the default state.\n" : "如果为名称指定了 C<all>，则该值适用于所有字符类型。下面的命令将所有字符设置为 C<s>，然后将 C<nl>、C<nl>、C<np> 和 C<sp> 设置为 C<m>，并禁用 C<esc>。这是默认状态。\n",
   "If I<name> begins with C<+>, add that character in addition to the existing configuration.\n" : "如果 I<name> 以 C<+> 开头，则在现有配置的基础上添加该字符。\n",
   "If a letter other than an alphabet or a number is given, it will be replaced by that letter.\n" : "如果输入的不是字母或数字，则会被该字母取代。\n",
   "If a string of two or more characters is given, it is interpreted as a Unicode character name.\n" : "如果输入两个或两个以上字符的字符串，该字符串将被解释为 Unicode 字符名。\n",
   "If an optional number is given for the B<-t> option, it is treated as a tab width. The following two commands are equivalent:\n" : "如果为 B<-t> 选项指定了一个可选数字，该数字将被视为制表符宽度。以下两条命令是等价的：\n",
   "If flag begins with C<+>, that character is added to the repeat list.\n" : "如果标志以 C<+> 开头，则该字符将被添加到重复列表中。\n",
   "In such cases, tab expansion can be temporarily enabled by the C<-t> option.\n" : "在这种情况下，可以使用 C<-t> 选项临时启用制表符扩展。\n",
   "Multiple items can be specified at the same time. The following example sets C<tab> and C<bel> to 0 and C<esc> to C<s>.\n" : "可以同时指定多个项目。下面的示例将 C<tab> 和 C<bel> 设置为 0，将 C<esc> 设置为 C<s>。\n",
   "Option C<-c nl=1> can also be used to visualize newline characters. For newline characters only, after displaying the result of the conversion, the original character is output at the same time.\n" : "选项 C<-c nl=1> 也可用于显示换行符。仅对于换行符，在显示转换结果后，会同时输出原始字符。\n",
   "Set tab head and following space characters. If the option value is longer than single character, it is evaluated as unicode name.\n" : "设置制表符头和后面的空格字符。如果选项值的长度超过单字符，则将其视为 unicode 名称。\n",
   "Set tab width.\n" : "设置制表符宽度。\n",
   "Set the style how tab is expanded. Select C<symbol> or C<shade> for example. If two style names are combined, like C<squat-arrow,middle-dot>, use C<squat-arrow> for tabhead and C<middle-dot> for tabspace.\n" : "设置制表符展开的样式。例如选择 C<symbol> 或 C<shade>。如果组合了两个样式名称，如 C<squat-arrow,middle-dot>，则在制表符头使用 C<squat-arrow>，在制表符空间使用 C<middle-dot>。\n",
   "Show available style list if called without parameter. Styles are defined in L<Text::ANSI::Fold> library.\n" : "如果调用时不带参数，则显示可用样式表。样式在 L<Text::ANSI::Fold> 库中定义。\n",
   "So the above command will have the same meaning as if you had written as following.\n" : "因此，上述命令的含义将与如下内容相同。\n",
   "Sometimes it is desirable to visualize whitespace characters. The C<cat -t> command can visualize tab characters, but the problem is that it breaks the visual format. We may want to see which parts are tabs and which parts are space characters while preserving the format. Extra whitespace characters at the end of a line can also be noticed by visualizing them.\n" : "有时需要将空白字符可视化。C<cat -t> 命令可以将制表符可视化，但问题是它破坏了可视化格式。我们可能希望在保留格式的同时，看到哪些部分是制表符，哪些部分是空白字符。行尾的额外空白字符也可以通过可视化来发现。\n",
   "Specifies the character type for outputting the original character at the same time as the converted character. The default setting is C<nl,np>. The following will correctly output the original ANSI sequence with the escape character visualized.\n" : "指定在输出转换字符的同时输出原始字符的字符类型。默认设置为 C<nl,np>。下面的命令将正确输出带有转义字符的原始 ANSI 序列。\n",
   "Tab characters are expanded by default. To explicitly disable it, use the B<-T> or B<--no-expand> option.\n" : "Tab 字符默认为展开字符。要明确禁用它，请使用 B<-T> 或 B<--no-expand> 选项。\n",
   "The C<cat -v> command is often used to display characters that cannot be displayed, but is not always suitable for viewing the output of modern applications because it converts all non-ASCII characters.\n" : "C<cat -v> 命令常用于显示无法显示的字符，但并不总是适合查看现代应用程序的输出，因为它会转换所有非 ASCII 字符。\n",
   "The C<cat-v> command visualizes whitespace and control characters while preserving the display of displayable graphic characters.\n" : "C<cat-v> 命令可将空白和控制字符可视化，同时保留显示可显示的图形字符。\n",
   "The predecessor of the C<cat-v> command was originally created as the filter module of the L<App::optex> command.\n" : "C<cat-v> 命令的前身最初是作为 L<App::optex> 命令的过滤器模块创建的。\n",
   "The second field is the default action. C<s> stands for symbol, C<m> for Unicode mark, and C<0> for no conversion.\n" : "第二个字段是默认操作。C<s> 表示符号，C<m> 表示 Unicode 标识，C<0> 表示不转换。\n",
   "To disable, give the value 0.\n" : "若要禁用，则设置值为 0。\n",
   "Use the names in the list above to specify by character type. If you want to convert escapes without converting tabs, use the following\n" : "使用上面列表中的名称来指定字符类型。如果要转换转义字符而不转换制表符，请使用以下命令\n",
   "Used alone, it activates the visibility of the character.\n" : "单独使用时，它可以激活该字符的可见性。\n",
   "Using C<cat-v>, tab characters are visualized in such a way that the space on the display does not change.\n" : "使用 C<cat-v>，制表符可以可视化，显示的空格不会改变。\n",
   "You can disable tab expansion by default by putting the following setting in your C<~/.cat-vrc> file.\n" : "通过在 C<~/.cat-vrc> 文件中设置以下选项，可以默认禁用制表符扩展。\n",
   "cat-v - visualize non-printing characters\n" : "cat-v - 可视化非打印字符\n",
   "cat-v [ options ] args ...\n" : "cat-v [ 选项 ] args ...\n"
}
